## Assignment_day3

## Create a dataframe using np.random.randn function with 5 rows and 4 columns, and performs various operations using pandas library

In [28]:
import pandas as pd 
import numpy as np

In [32]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(5), index=["a", "b", "c", "d","e"]),
        "two": pd.Series(np.random.randn(5), index=["a", "b", "c", "d","e"]),
        "three": pd.Series(np.random.randn(5), index=["a", "b", "c", "d","e"]),
        "four":pd.Series(np.random.randn(5), index=["a", "b", "c", "d","e"]),
    }
)

In [33]:
df

        one       two     three      four
a -1.114568  1.128808  0.937655  0.736765
b  1.114471  0.644002  1.232655 -0.425525
c -0.398425 -1.059941 -0.851227  0.348391
d -0.000070 -0.250159  1.214339 -0.539143
e -1.448570 -0.664320  0.856649  1.935997

In [34]:
row = df.iloc[1]

In [35]:
column = df["two"]

In [36]:
df.sub(row, axis="columns")

        one       two     three      four
a -2.229039  0.484807 -0.295000  1.162290
b  0.000000  0.000000  0.000000  0.000000
c -1.512896 -1.703943 -2.083882  0.773915
d -1.114541 -0.894161 -0.018315 -0.113618
e -2.563041 -1.308322 -0.376006  2.361521

In [37]:
df.sub(row, axis=1)

        one       two     three      four
a -2.229039  0.484807 -0.295000  1.162290
b  0.000000  0.000000  0.000000  0.000000
c -1.512896 -1.703943 -2.083882  0.773915
d -1.114541 -0.894161 -0.018315 -0.113618
e -2.563041 -1.308322 -0.376006  2.361521

In [38]:
df.sub(column, axis="index")

        one  two     three      four
a -2.243377  0.0 -0.191154 -0.392043
b  0.470469  0.0  0.588653 -1.069526
c  0.661516  0.0  0.208714  1.408331
d  0.250089  0.0  1.464498 -0.288984
e -0.784250  0.0  1.520969  2.600317

In [39]:
df.sub(column, axis=0)

        one  two     three      four
a -2.243377  0.0 -0.191154 -0.392043
b  0.470469  0.0  0.588653 -1.069526
c  0.661516  0.0  0.208714  1.408331
d  0.250089  0.0  1.464498 -0.288984
e -0.784250  0.0  1.520969  2.600317

In [44]:
s = pd.Series(np.arange(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32